Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/atdf/ATSAME70J20.atdf
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Mask of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Mask of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Mask of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:DACC_ISR">
          <bitfield caption="Transmit Ready Interrupt Flag of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Flag of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Flag of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Flag of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
        </register>
        <register caption="Write Protection Mode Register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="DACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__MAXS0">
        <value caption="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" name="TRIG_EVENT" value="0"/>
        <value caption="Max speed mode enabled." name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS1">
        <value caption="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" name="TRIG_EVENT" value="0"/>
        <value caption="Max speed mode enabled." name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="One data to convert is written to the FIFO per access to DACC." name="DISABLED" value="0"/>
        <value caption="Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__DIFF">
        <value caption="DAC0 and DAC1 are single-ended outputs." name="DISABLED" value="0"/>
        <value caption="DACP and DACN are differential outputs. The differential level is configured by the channel 0 value." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGEN0">
        <value caption="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGEN1">
        <value caption="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL0">
        <value caption="DATRG" name="TRGSEL0" value="0x0"/>
        <value caption="TC0 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC1 output" name="TRGSEL2" value="0x2"/>
        <value caption="TC2 output" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM0 event 1" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 0" name="TRGSEL6" value="0x6"/>
        <value caption="PWM1 event 1" name="TRGSEL7" value="0x7"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL1">
        <value caption="DATRG" name="TRGSEL0" value="0x0"/>
        <value caption="TC0 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC1 output" name="TRGSEL2" value="0x2"/>
        <value caption="TC2 output" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 0" name="TRGSEL4" value="0x4"/>
        <value caption="PWM0 event 1" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 0" name="TRGSEL6" value="0x6"/>
        <value caption="PWM1 event 1" name="TRGSEL7" value="0x7"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR0">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR1">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
